app/controllers/homes_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."speed" ASC
---
  def orderUser
    User.all.order(:speed)