app/controllers/homes_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "speed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def top
    puts "top"
    if params[:onlySpeed]
      puts "onlySpeed"
      crtScore = session[:score]
      print crtScore
      #todo スピードだけデータベースに保存する処理

      user = User.new

      time = (Time.now).to_s

      user.name = "NoName"
      user.email =  time + ".gmail.com"
      user.password = "123456"
      user.password_confirmation = "123456"
      user.speed = crtScore

      user.save