app/controllers/sessions_controller.rb

    def create
      user = User.find_by_email(params[:email])
      if user && user.authenticate(params[:password])
        @score =  session[:score]

        print "\n login"
        print "\n" +  @score + " \n\n"

        #todo userのスコアを更新する
        user.update(speed: @score)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ryu@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "speed" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["speed", 20], ["updated_at", "2022-07-04 12:35:35.882484"], ["id", 38]]